{
    "heading": "Experiencia",
    "positions": [
        {
          "date": "Octubre 2024",
          "positionAndCompany": "Ingeniero Asociado / Desarrollador Frontend. HCLTech.",
          "description": "Ya veremos. 游땸"
        },
        {
          "date": "Agosto 2023",
          "positionAndCompany": "Desarrollador Web Fullstack. Henry Bootcamp.",
          "description":
            "Complet칠 m치s de 800 horas de contenido te칩rico-pr치ctico, que incluyeron la creaci칩n de diversos proyectos y el aprendizaje de m칰ltiples tecnolog칤as. Adquir칤 experiencia pr치ctica en desarrollo de software, incluyendo programaci칩n frontend y backend, control de versiones y pr치cticas de codificaci칩n colaborativa."
        },
        {
          "date": "Julio 2022",
          "positionAndCompany":
            "Mantenimiento Electromec치nico. Escuela de Aviaci칩n M칠xico.",
          "description":
            "Experiencia en el mantenimiento de simuladores de vuelo, incluyendo cambios de aceite en actuadores hidr치ulicos y cableado de paneles de control. Habilidad en el corte de acr칤lico para m치scaras de paneles e implementaci칩n de c칩digo en Arduino para calibrar instrumentos con potenci칩metros. Gesti칩n de inventario, clasificaci칩n de equipo y soporte t칠cnico a diversas 치reas para asegurar el correcto funcionamiento del simulador."
        },
        {
          "date": "Mayo 2021",
          "positionAndCompany":
            "Mantenimiento Mec치nico. Minigrip de M칠xico S.A. de C.V.",
          "description":
            "M치s de un a침o de experiencia en mantenimiento preventivo y correctivo de maquinaria industrial, incluyendo motores bif치sicos y trif치sicos de 220-440V con conexiones delta/estrella. Lubricaci칩n de m치quinas como parte de mantenimiento, manejo de herramientas y selecci칩n de componentes como rodamientos, bandas y torniller칤a. Apoyo a operadores, coordinaci칩n con otros departamentos y gesti칩n de inventarios para asegurar el funcionamiento eficiente del equipo."
        }
      ]
}